Revit 2027 API
BasicFileInfo.IsLocal Property
 Checks if the file is workshared and Local.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsLocal { get; }
Public ReadOnly Property IsLocal As Boolean
	Get
public:
property bool IsLocal {
	bool get ();
}
member IsLocal : bool with get
Property Value
Boolean
See Also
Reference
BasicFileInfo Class
Autodesk.Revit.DB Namespace